{
  "id": "59515813-f743-4063-80f6-ba2ea32e417e",
  "revision": 0,
  "last_node_id": 27,
  "last_link_id": 20,
  "nodes": [
    {
      "id": 17,
      "type": "ShowText|pysssss",
      "pos": [
        1140,
        640
      ],
      "size": [
        770,
        130
      ],
      "flags": {},
      "order": 5,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 20
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "shape": 6,
          "type": "STRING",
          "links": null
        }
      ],
      "properties": {
        "cnr_id": "comfyui-custom-scripts",
        "ver": "1.2.5",
        "Node name for S&R": "ShowText|pysssss",
        "ue_properties": {
          "version": "7.0.1",
          "widget_ue_connectable": {}
        }
      },
      "widgets_values": [
        "Realistic photo in yellow tones, young chinese lady, analog photo, candid, fantasy portrait, horizon, 20yo female, high skin details, polaroids, photo, realistic, bokeh, shallow depth of field, beautiful eyes, high detail eyes, beautiful face, high detail face, high detail skin, beautiful hands, beautiful fingers, beautiful eyelashes, fingernails, aestheticism, cinematic, elegant pose, close-up shot, (profile:1. 2), This is a high-resolution photograph featuring a young Chinese woman with long, wavy, light brown hair. She has a light brown complexion and is of East Asian descent. The image captures her in a natural, outdoor setting surrounded by vibrant pink oleander flowers. The flowers are in full bloom, with their delicate petals and green leaves creating a lush, colorful backdrop. The woman is wearing a sleeveless, white dress with thin straps that reveal her bare shoulders. Her expression is calm and slightly enigmatic, with her lips slightly parted and her gaze directed towards the camera. She appears to be in her early twenties, with a slender build and medium-sized breasts. The background is a mix of green foliage and the pink oleander flowers, creating a harmonious contrast with her dark dress. The lighting is soft and natural, likely from diffused daylight, which enhances the colors and textures of the scene. The overall mood is serene and slightly romantic, with the focus on the woman's face and the flowers framing her. "
      ]
    },
    {
      "id": 19,
      "type": "ShowText|pysssss",
      "pos": [
        1140,
        430
      ],
      "size": [
        770,
        160
      ],
      "flags": {},
      "order": 9,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 19
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "shape": 6,
          "type": "STRING",
          "links": null
        }
      ],
      "properties": {
        "cnr_id": "comfyui-custom-scripts",
        "ver": "1.2.5",
        "Node name for S&R": "ShowText|pysssss",
        "ue_properties": {
          "version": "7.0.1",
          "widget_ue_connectable": {}
        }
      },
      "widgets_values": [
        "Realistic photo in soft tones, horizon, high skin details, photo, realistic, backlight, holo light, spot light, A young Chinese woman with long, wavy brown hair sits in front of a blurred urban backdrop, likely a street scene. Her skin is light, and she's got a slender, petite build. She's rocking a casual look with a white tank top that shows off her modest bust and high-waisted blue jeans. Over her tank top, she's wearing an open light-blue long sleeve jacket, giving off a laid-back, stylish vibe. She's looking off to the side with a thoughtful expression, her lips slightly parted. She wore a simple silver round necklace. Her makeup is minimal, highlighting her natural beauty with a touch of gloss on her lips and subtle eye makeup. The lighting is warm and natural, casting soft shadows that add depth to the image. The photo is taken from a low angle, making her appear more dominant and adding a sense of intimacy. The background is intentionally blurred, using a shallow depth of field, which keeps the focus on her while hinting at the urban environment without being distracting. The composition follows the rule of thirds, with her positioned slightly off-center, creating a balanced and visually appealing shot. The overall aesthetic quality of the image is very high, with a professional touch and a keen eye for detail. The colors are rich and vibrant, enhancing the mood and atmosphere of the scene. The image exudes a sense of calm and introspection. "
      ]
    },
    {
      "id": 21,
      "type": "ShowText|pysssss",
      "pos": [
        1140,
        110
      ],
      "size": [
        770,
        110
      ],
      "flags": {},
      "order": 7,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 17
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "shape": 6,
          "type": "STRING",
          "links": null
        }
      ],
      "properties": {
        "cnr_id": "comfyui-custom-scripts",
        "ver": "1.2.5",
        "Node name for S&R": "ShowText|pysssss",
        "ue_properties": {
          "version": "7.0.1",
          "widget_ue_connectable": {}
        }
      },
      "widgets_values": [
        "Realistic photo in cyan tones, young chinese lady, analog photo, candid, fantasy portrait, horizon, 20yo female, high skin details, polaroids, photo, realistic, bokeh, shallow depth of field, beautiful eyes, high detail eyes, beautiful face, high detail face, high detail skin, beautiful hands, beautiful fingers, beautiful eyelashes, fingernails, aestheticism, cinematic, elegant pose, fullbody shot, This is a photograph of a young chinese lady sitting on concrete steps. She has long dark hair styled in two braids that fall over her shoulders. Her skin is light, and she has a cheerful expression with a wide smile and half-closed eyes, suggesting she is enjoying the moment. She is holding a large slice of watermelon in her hands, which she is about to take a bite from. The watermelon is bright red with a green rind and has small black seeds scattered throughout. There is a pot of green plants placed on the stairs. The girl is wearing a light red short-sleeved shirt and dark blue loose-fitting pants that appear to be made of a soft, lightweight fabric. She is also wearing brown sandals with straps that wrap around her ankles. The steps she is sitting on are made of concrete and appear worn, suggesting they are outdoors. The background is slightly blurred, indicating that the focus is on the lady and the watermelon. There is a hint of a white wall in the background, adding a neutral backdrop to the scene. The overall mood of the photograph is light and joyful, capturing a simple."
      ]
    },
    {
      "id": 22,
      "type": "ShowText|pysssss",
      "pos": [
        1140,
        270
      ],
      "size": [
        770,
        110
      ],
      "flags": {},
      "order": 6,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 18
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "shape": 6,
          "type": "STRING",
          "links": null
        }
      ],
      "properties": {
        "cnr_id": "comfyui-custom-scripts",
        "ver": "1.2.5",
        "Node name for S&R": "ShowText|pysssss",
        "ue_properties": {
          "version": "7.0.1",
          "widget_ue_connectable": {}
        }
      },
      "widgets_values": [
        "Realistic photo in sunny tones, young chinese lady, analog photo, candid, fantasy portrait, horizon, 20yo female, high skin details, polaroids, photo, realistic, aestheticism, cinematic, elegant pose, backlight, soft smile, holo light，glaring light, A young Chinese woman stands outside in a snowy wonderland, grinning at the camera. She's smack dab in the middle-left of the frame, following the rule of thirds for a balanced look. The snow is falling all around her, creating a magical vibe. She's got straight, dark brown hair that hangs just past her shoulders and a fair complexion. Her outfit is a black coat with a fur-lined hood, perfect for the chilly weather. She has a brown scarf around her neck, adding a bit of flair to her winter gear. Her hands are stuffed into the coat's pockets, and she's rocking a black top underneath. The background is a blur of snow-covered trees and bushes, making her pop out in the foreground. The snow looks soft and fluffy, with a slight haze from the falling snowflakes. The lighting is soft and natural, with the snow acting like a diffuser, giving a gentle glow to her face. The overall aesthetic quality of the image is very high, with a dreamy, serene vibe. The snowfall adds a sense of movement and tranquility, while the woman's happy expression gives a warm touch to the cold scene. The camera angle is straight-on, capturing her at eye level, which makes her feel approachable and friendly. This shot nails the perfect mix of winter beauty and human warmth."
      ]
    },
    {
      "id": 20,
      "type": "ShowText|pysssss",
      "pos": [
        1140,
        -70
      ],
      "size": [
        770,
        130
      ],
      "flags": {},
      "order": 8,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 16
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "shape": 6,
          "type": "STRING",
          "links": null
        }
      ],
      "properties": {
        "cnr_id": "comfyui-custom-scripts",
        "ver": "1.2.5",
        "Node name for S&R": "ShowText|pysssss",
        "ue_properties": {
          "version": "7.0.1",
          "widget_ue_connectable": {}
        }
      },
      "widgets_values": [
        "A Vietnamese soul standing at the entrance of a shadowy forest, glowing mist surrounding ancient stone steps leading downward, floating lotus petals in the air, dark yet mystical ambiance, surreal spiritual atmosphere, inspired by Vietnamese ghost legends"
      ]
    },
    {
      "id": 27,
      "type": "Duck_LoadGoogleSheetOneRow",
      "pos": [
        820,
        640
      ],
      "size": [
        300,
        130
      ],
      "flags": {},
      "order": 0,
      "mode": 0,
      "inputs": [],
      "outputs": [
        {
          "name": "prompt",
          "shape": 6,
          "type": "STRING",
          "links": [
            20
          ]
        }
      ],
      "properties": {
        "cnr_id": "Duck_Nodes",
        "ver": "396b880978f6ac7952dcbc4ba50ea3a79044322e",
        "Node name for S&R": "Duck_LoadGoogleSheetOneRow"
      },
      "widgets_values": [
        "Google Sheet URL",
        "A2:A",
        0,
        "increment"
      ],
      "color": "#6e6e1d"
    },
    {
      "id": 25,
      "type": "Duck_LoadWordLine",
      "pos": [
        820,
        270
      ],
      "size": [
        300,
        110
      ],
      "flags": {},
      "order": 1,
      "mode": 0,
      "inputs": [],
      "outputs": [
        {
          "name": "prompt",
          "type": "STRING",
          "links": [
            18
          ]
        }
      ],
      "properties": {
        "cnr_id": "Duck_Nodes",
        "ver": "396b880978f6ac7952dcbc4ba50ea3a79044322e",
        "Node name for S&R": "Duck_LoadWordLine"
      },
      "widgets_values": [
        "C:\\path\\to\\your\\file.docx",
        0,
        "increment"
      ],
      "color": "#6e6e1d"
    },
    {
      "id": 24,
      "type": "Duck_LoadGoogleDocLine",
      "pos": [
        820,
        110
      ],
      "size": [
        300,
        110
      ],
      "flags": {},
      "order": 2,
      "mode": 0,
      "inputs": [],
      "outputs": [
        {
          "name": "prompt",
          "type": "STRING",
          "links": [
            17
          ]
        }
      ],
      "properties": {
        "cnr_id": "Duck_Nodes",
        "ver": "396b880978f6ac7952dcbc4ba50ea3a79044322e",
        "Node name for S&R": "Duck_LoadGoogleDocLine"
      },
      "widgets_values": [
        "Google Docs URL",
        0,
        "increment"
      ],
      "color": "#6e6e1d"
    },
    {
      "id": 23,
      "type": "Duck_PromptLoader",
      "pos": [
        820,
        -70
      ],
      "size": [
        300,
        130
      ],
      "flags": {},
      "order": 3,
      "mode": 0,
      "inputs": [],
      "outputs": [
        {
          "name": "prompt",
          "type": "STRING",
          "links": [
            16
          ]
        },
        {
          "name": "line_count",
          "type": "INT",
          "links": null
        }
      ],
      "properties": {
        "cnr_id": "Duck_Nodes",
        "ver": "396b880978f6ac7952dcbc4ba50ea3a79044322e",
        "Node name for S&R": "Duck_PromptLoader"
      },
      "widgets_values": [
        "C:\\path\\to\\your\\file.txt",
        0,
        "increment"
      ],
      "color": "#6e6e1d"
    },
    {
      "id": 26,
      "type": "Duck_LoadExcelRow",
      "pos": [
        820,
        430
      ],
      "size": [
        300,
        160
      ],
      "flags": {},
      "order": 4,
      "mode": 0,
      "inputs": [],
      "outputs": [
        {
          "name": "prompt",
          "shape": 6,
          "type": "STRING",
          "links": [
            19
          ]
        }
      ],
      "properties": {
        "cnr_id": "Duck_Nodes",
        "ver": "396b880978f6ac7952dcbc4ba50ea3a79044322e",
        "Node name for S&R": "Duck_LoadExcelRow"
      },
      "widgets_values": [
        "C:\\path\\to\\your\\file.xlsx",
        "Sheet1",
        "A2:A",
        0,
        "increment"
      ],
      "color": "#6e6e1d"
    }
  ],
  "links": [
    [
      16,
      23,
      0,
      20,
      0,
      "STRING"
    ],
    [
      17,
      24,
      0,
      21,
      0,
      "STRING"
    ],
    [
      18,
      25,
      0,
      22,
      0,
      "STRING"
    ],
    [
      19,
      26,
      0,
      19,
      0,
      "STRING"
    ],
    [
      20,
      27,
      0,
      17,
      0,
      "STRING"
    ]
  ],
  "groups": [],
  "config": {},
  "extra": {
    "ds": {
      "scale": 0.8902080858797816,
      "offset": [
        -369.65961564238745,
        135.3635795990042
      ]
    },
    "ue_links": [],
    "links_added_by_ue": [],
    "frontendVersion": "1.24.4",
    "VHS_latentpreview": false,
    "VHS_latentpreviewrate": 0,
    "VHS_MetadataImage": true,
    "VHS_KeepIntermediate": true
  },
  "version": 0.4
}